Agat/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.ВариантыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Agat/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры



&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
							Объект.Дата, СтрокаТабличнойЧасти.Материал);
	// Пересчитать сумму строки
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры






//============================================================================
//команда выбор номенклатуры из справочника Номенклатура в реквизит текущий реквизит Материал

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.Материалы.ДобавитьСтроку();
	Элементы.Материалы.ТекущиеДанные.Материал = ВыбранноеЗначение;

	
//Множественный выбор выделение нескольких элементов (не работает цикл)	
//		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
//			НоваяСтрока = Объект.Материалы.Добавить();
//			НоваяСтрока.Материал = ВыбранныйЭлемент;
//		КонецЦикла;


//============================================================================	
	//подстановка цены за единицу из регистра свдений Цены 
	
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(
							Объект.Дата, СтрокаТабличнойЧасти.Материал);
	// Пересчитать сумму строки
	РаботаСДокументами.РасчитатьСумму(СтрокаТабличнойЧасти);	
	
//============================================================================	
	
КонецПроцедуры


//============================================================================
